# Parameters
nc: 1                 # number of classes (针对 SSDD 单类)
#depth_multiple: 0.33  # model depth multiple (YOLOv5n 级别)
#width_multiple: 0.25  # layer channel multiple (YOLOv5n 级别)
depth_multiple: 0.67 # model depth multiple
width_multiple: 0.75 # layer channel multiple

anchors:
  - [10, 13, 16, 30, 33, 23]     # P3/8
  - [30, 61, 62, 45, 59, 119]    # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# =======================================================
# (a) Spatial Encoder (基于 YOLOv5 Backbone 引入 MHA)
# =======================================================
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv,[128, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [128]],            # 2
   [-1, 1, Conv,[256, 3, 2]],    # 3-P3/8
   [-1, 6, C3, [256]],            # 4 (P3 侧边输出)
   [-1, 1, Conv,[512, 3, 2]],    # 5-P4/16
   [-1, 9, C3, [512]],            # 6 (P4 侧边输出)
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32
   [-1, 3, C3, [1024]],           # 8
   [-1, 1, SPPF, [1024, 5]],      # 9
   [-1, 1, MHABlock, [8]],        # 10 - 结合图(a)在 Backbone 末尾加入 MHA
  ]

# =======================================================
# (b) Fine-Grained Feature Aggregation Encoder (引入 FFAE)
# (c) Multi-dimensional Awareness Attention Decoder (MAAD)
# =======================================================
head:
  [[-1, 1, Conv, [512, 1, 1]],                    # 11
   [-1, 1, FFAEContentAwareUpsampling,[2, 32, 3, 7]], # 12 - 替换原版上采样
   [[-1, 6], 1, Concat, [1]],                     # 13 cat backbone P4
   [-1, 3, C3, [512, False]],                     # 14 (P4_1 完整特征)
   [-1, 1, Conv, [256, 1, 1]],                    # 15
   [-1, 1, FFAEContentAwareUpsampling, [2, 32, 3, 7]], # 16 - 替换原版上采样
   [[-1, 4], 1, Concat, [1]],                     # 17 cat backbone P3
   [-1, 3, C3,[256, False]],                     # 18 (P3 输出)

   [-1, 1, Conv,[256, 3, 2]],                    # 19 (自底向上 下采样)
   [[-1, 14], 1, Concat, [1]],                    # 20 ⚠️修复：与完整的 P4_1(14层) 拼接，而非压缩层(15层)
   [-1, 3, C3, [512, False]],                     # 21 (P4 输出)
   [-1, 1, Conv, [512, 3, 2]],                    # 22 (自底向上 下采样)
   [[-1, 11], 1, Concat, [1]],                    # 23 cat head P5
   [-1, 3, C3,[1024, False]],                    # 24 (P5 输出)

   # === 结合图(c) 将 MAAD 作为预测前的 Perception Layer ===
   [18, 1, MAADDecoder, [2]],                     # 25 - MAAD 应用于 P3 分支
   [21, 1, MAADDecoder, [2]],                     # 26 - MAAD 应用于 P4 分支
   [24, 1, MAADDecoder, [2]],                     # 27 - MAAD 应用于 P5 分支

   [[25, 26, 27], 1, Detect, [nc, anchors]],      # 28 最终检测头
   ]
